app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 2]]
SELECT 1 AS one FROM "posts" WHERE "posts"."sub_id" = $1 LIMIT $2  [["sub_id", 3], ["LIMIT", 1]]
---
<a href="<%=new_post_url%>">Create a Post</a>
<% unless @sub.posts.empty? %>