app/controllers/posts_controller.rb

SELECT "subs".* FROM "subs"
---
    def new
        @subs = Sub.all