app/controllers/subs_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = $1  [["sub_id", 2]]
SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @posts = Sub.find_by(id: params[:id]).posts

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Cat Pictures2"], ["description", ""], ["moderator_id", 1], ["created_at", "2022-11-18 22:20:22.749784"], ["updated_at", "2022-11-18 22:20:22.749784"]]
---
    def create
        @sub = Sub.new(sub_params)
        if @sub&.save

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @sub = Sub.find_by(id: params[:id])

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "Pics of super doggos"], ["updated_at", "2022-11-18 23:40:00.897050"], ["id", 3]]
---
    def update
        @sub = Sub.find_by(id: params[:id])
        if @sub&.update(sub_params)

SELECT "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def is_moderator?
        sub = Sub.find_by(id: params[:id])