app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "momo"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-18 19:56:52.753887"], ["updated_at", "2022-11-18 19:56:52.753887"]]
---
    def create
        @user = User.new(user_params)
        # puts @user
        if @user&.save

SELECT "subs".* FROM "subs" WHERE "subs"."moderator_id" = $1 LIMIT $2  [["moderator_id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def show
        @subs = Sub.where(moderator_id: current_user.id)
        @user = User.find_by(id: params[:id])